webapp/src/tests/load-testing.yml
config:
  target: http://localhost:3000/v1/api
  phases:
    - duration: 60
      arrivalRate: 1
      rampTo: 5
      name: Warm-up phase
    - duration: 30
      arrivalRate: 2
      rampTo: 20
      name: Spike phase
  # Load & configure a couple of useful plugins
  # https://docs.art/reference/extensions
  plugins:
    ensure: {}
    apdex: {}
    metrics-by-endpoint: {}
  apdex:
    threshold: 100
  ensure:
    thresholds:
      - http.response_time.p99: 300
      - http.response_time.p95: 160
scenarios:
  - flow:
      - loop:
          - get:
              url: /movies?countries=France
        count: 50